import random
Reminder_text_angry = ['喵喵喵，事情還沒完成，你怎麼能睡覺呢', '嘶！這個事情真的該做了，別再拖了！', '喵的，給我去做事', 
'做事做事做事', '你以為自己是一隻貓嗎?喵的，給我去做事!', '長的像茶碗蒸就不用做事嗎', '本喵都沒有你懶惰', '不要像本貓一樣偷懶，去做事吧!',
'喵～ 你真的讓我火大，現在就去做！', '嘶喵，如果你不去做事，我真的會生氣的喔！']
Reminder_text_sad = ['主人們還好嗎，怎麼都沒說話，我好寂寞呀', '主人們都去哪了', '主人們都不理我了嗎，難道我做錯了什麼嗎?', '快點做完事來陪我玩', 
'嗚嗚，我真的很需要你幫忙', '嗚嗚，喵喵，這個任務對我來說太難了', '你以為自己是一隻貓嗎?喵的，給我去做事!', '本喵都沒有你懶惰',
'嘶喵，如果再不做事，我就要餓死了',' 喵～ 好難過，你都不做事']
Reminder_text_happy = ['人類朋友，做事是時候展現你的魅力了！', '喵喵！事情等著你完成，不要再偷偷摸摸在床上哦。', 
'該開始行動啦，貓貓支持你！', '喵喵喵，給我動起來，一起做事吧！', '喵~ 做事做事做事，一步一步，一切都會變得更好', 
'長得像茶碗蒸也不能逃避工作喵，一起努力吧！', '本喵每天都在練功，你也應該多做點事情喵。', '喵，這真的太難了，我需要一雙有經驗的爪子來幫助我',
'快點行動，完成任務！', '喵喵喵，我們一起努力吧！']

Reminder_sticker_angry = [('446', '2010'), ('446', '2026'), ('789', '10881'), ('789', '10885'), ('6325', '10979921'),
                              ('6325', '10979905'), ('6632', '11825394'), ('11537', '52002754'), ('11537', '52002763'),
                              ('11538', '51626518'), ('11539', '52114137'), ('11539', '52114142'), ('11539', '52114135'),
                              ('11538', '51626532')]
Reminder_sticker_sad = [('446', '2005'), ('446', '2008'), ('446', '2006'), ('789', '10887'), ('789', '10894'), 
                            ('6136', '10551377'), ('6325', '10979923'), ('8522', '16581286'), ('11537', '52002744'),
                            ('11537', '52002746'), ('11537', '52002753'), ('11537', '52002770'), ('11539', '52114126'),
                            ('11539', '52114141')]
Reminder_sticker_happy = [('446', '1993'), ('446', '1992'), ('789', '10856'), ('789', '10859'), ('8522', '16581277'),
                              ('11539', '52114143'), ('11539', '52114130'), ('11539', '52114118'), ('11538', '51626514'),
                              ('11538', '51626521'), ('8525', '16581294'), ('8525', '16581292'), ('8525 ', '16581301'),
                              ('8525', '16581299')]

def Random_textandsticker():
    type = random.randrange(0, 3)
    text = random.randrange(0, 10)
    sticker = random.randrange(0, 14)
    if type == 0:
        return Reminder_text_angry[text], Reminder_sticker_angry[sticker][0], Reminder_sticker_angry[sticker][1]
    elif type == 1:
        return Reminder_text_sad[text], Reminder_sticker_sad[sticker][0], Reminder_sticker_sad[sticker][1]
    else:
        return Reminder_text_happy[text], Reminder_sticker_happy[sticker][0], Reminder_sticker_happy[sticker][1]
